0x00000000004010f4 <+0>:     push   %r14
   0x00000000004010f6 <+2>:     push   %r13
   0x00000000004010f8 <+4>:     push   %r12
   0x00000000004010fa <+6>:     push   %rbp
   0x00000000004010fb <+7>:     push   %rbx
   0x00000000004010fc <+8>:     sub    $0x50,%rsp
   0x0000000000401100 <+12>:    mov    %rsp,%r13
   0x0000000000401103 <+15>:    mov    %rsp,%rsi
   0x0000000000401106 <+18>:    call   0x40145c <read_six_numbers>

   0x000000000040110b <+23>:    mov    %rsp,%r14
   0x000000000040110e <+26>:    mov    $0x0,%r12d

    # 外部循环 一点一点的加 r13 到下一个数 然后比较后面的数与这个数是不是相等
        0x0000000000401114 <+32>:    mov    %r13,%rbp
        0x0000000000401117 <+35>:    mov    0x0(%r13),%eax
        0x000000000040111b <+39>:    sub    $0x1,%eax
        0x000000000040111e <+42>:    cmp    $0x5,%eax
        0x0000000000401121 <+45>:    jbe    0x401128 <phase_6+52>
        0x0000000000401123 <+47>:    call   0x40143a <explode_bomb>
        0x0000000000401128 <+52>:    add    $0x1,%r12d
        0x000000000040112c <+56>:    cmp    $0x6,%r12d
        # r12d等于6的时候判断完了
        0x0000000000401130 <+60>:    je     0x401153 <phase_6+95>
        0x0000000000401132 <+62>:    mov    %r12d,%ebx

                # 内循环 判断元素不能相等
                0x0000000000401135 <+65>:    movslq %ebx,%rax
                0x0000000000401138 <+68>:    mov    (%rsp,%rax,4),%eax
                0x000000000040113b <+71>:    cmp    %eax,0x0(%rbp)
                0x000000000040113e <+74>:    jne    0x401145 <phase_6+81>
                0x0000000000401140 <+76>:    call   0x40143a <explode_bomb>
                0x0000000000401145 <+81>:    add    $0x1,%ebx
                0x0000000000401148 <+84>:    cmp    $0x5,%ebx
                0x000000000040114b <+87>:    jle    0x401135 <phase_6+65>

        0x000000000040114d <+89>:    add    $0x4,%r13
        0x0000000000401151 <+93>:    jmp    0x401114 <phase_6+32>

   0x0000000000401153 <+95>:    lea    0x18(%rsp),%rsi
   0x0000000000401158 <+100>:   mov    %r14,%rax
   0x000000000040115b <+103>:   mov    $0x7,%ecx

   # 每个数都被7 减掉 再重新放回到原位置
    0x0000000000401160 <+108>:   mov    %ecx,%edx
    0x0000000000401162 <+110>:   sub    (%rax),%edx
    0x0000000000401164 <+112>:   mov    %edx,(%rax)
    0x0000000000401166 <+114>:   add    $0x4,%rax
    0x000000000040116a <+118>:   cmp    %rsi,%rax
    0x000000000040116d <+121>:   jne    0x401160 <phase_6+108>

    # 这里其实有一个node
    # struct node{
    #   int val;
    #   int data;
    #   struct node* next;
    # };
    # 开始另外一个外循环 esi = 0
    # 这里有个链表结构
        0x000000000040116f <+123>:   mov    $0x0,%esi
        0x0000000000401174 <+128>:   jmp    0x401197 <phase_6+163>

                
                # 循环 mov    0x8(%rdx),%rdx 语句，实际上就是一直在 next ，直到现在的第一个数等于一点一点递增的1
                # 这里循环看是把哪个 node 对应的地址放到 rdx 然后放到 rsp 上面
                0x0000000000401176 <+130>:   mov    0x8(%rdx),%rdx
                0x000000000040117a <+134>:   add    $0x1,%eax
                0x000000000040117d <+137>:   cmp    %ecx,%eax
                0x000000000040117f <+139>:   jne    0x401176 <phase_6+130>

        0x0000000000401181 <+141>:   jmp    0x401188 <phase_6+148>
        0x0000000000401183 <+143>:   mov    $0x6032d0,%edx
        0x0000000000401188 <+148>:   mov    %rdx,0x20(%rsp,%rsi,2) # 这里把rdx的值给到了 rsp + 32 + 2*rsi 每次多加了8 
        0x000000000040118d <+153>:   add    $0x4,%rsi
        0x0000000000401191 <+157>:   cmp    $0x18,%rsi
        0x0000000000401195 <+161>:   je     0x4011ab <phase_6+183>


        0x0000000000401197 <+163>:   mov    (%rsp,%rsi,1),%ecx # 一点一点的拿值 如果里面有一个值是1的话 就会把rdx重置
        0x000000000040119a <+166>:   cmp    $0x1,%ecx
        0x000000000040119d <+169>:   jle    0x401183 <phase_6+143>
        0x000000000040119f <+171>:   mov    $0x1,%eax
        0x00000000004011a4 <+176>:   mov    $0x6032d0,%edx
        0x00000000004011a9 <+181>:   jmp    0x401176 <phase_6+130>

    # 从这里开始就是讨论 32 地址往上走了
    # 这里实现了 node1.next = node2
   0x00000000004011ab <+183>:   mov    0x20(%rsp),%rbx
   0x00000000004011b0 <+188>:   lea    0x28(%rsp),%rax
   0x00000000004011b5 <+193>:   lea    0x50(%rsp),%rsi
   0x00000000004011ba <+198>:   mov    %rbx,%rcx

        0x00000000004011bd <+201>:   mov    (%rax),%rdx
        0x00000000004011c0 <+204>:   mov    %rdx,0x8(%rcx) # 这里拿到的地址是 node 的首地址，然后加 8 就是 next 的地址

        0x00000000004011c4 <+208>:   add    $0x8,%rax
        0x00000000004011c8 <+212>:   cmp    %rsi,%rax
        0x00000000004011cb <+215>:   je     0x4011d2 <phase_6+222>
        0x00000000004011cd <+217>:   mov    %rdx,%rcx
        0x00000000004011d0 <+220>:   jmp    0x4011bd <phase_6+201>

    # 递减
   0x00000000004011d2 <+222>:   movq   $0x0,0x8(%rdx)
   0x00000000004011da <+230>:   mov    $0x5,%ebp

        0x00000000004011df <+235>:   mov    0x8(%rbx),%rax
        0x00000000004011e3 <+239>:   mov    (%rax),%eax
            
        0x00000000004011e5 <+241>:   cmp    %eax,(%rbx)
        0x00000000004011e7 <+243>:   jge    0x4011ee <phase_6+250>
        0x00000000004011e9 <+245>:   call   0x40143a <explode_bomb>
        0x00000000004011ee <+250>:   mov    0x8(%rbx),%rbx
        0x00000000004011f2 <+254>:   sub    $0x1,%ebp
        0x00000000004011f5 <+257>:   jne    0x4011df <phase_6+235>

   0x00000000004011f7 <+259>:   add    $0x50,%rsp
   0x00000000004011fb <+263>:   pop    %rbx
   0x00000000004011fc <+264>:   pop    %rbp
   0x00000000004011fd <+265>:   pop    %r12
   0x00000000004011ff <+267>:   pop    %r13
   0x0000000000401201 <+269>:   pop    %r14
   0x0000000000401203 <+271>:   ret   